app/controllers/controls_controller.rb

SELECT * FROM "control"
---
  def index
    @controls = Control.all