app/controllers/timelines_controller.rb

  def index
    @timelines = Timeline.all
---
SELECT * FROM "timeline"

  def create
    @timeline = Timeline.new(params[:timeline])

    respond_to do |format|
      if @timeline.save
---
INSERT INTO "timeline" ("beg_date", "dt_create", "end_time", "total_time", "billable", "bug_nbr", "personal_time", "recid", "project", "dt_edit", "client", "case_nbr", "empid", "task", "timecard", "description", "off_time", "beg_time") VALUES('2009-08-02 17:12:00', '2009-08-02 17:12:00', '2009-08-02 17:12:00', NULL, 'f', '', NULL, 6, '', '2009-08-02 17:12:00', '', '', 'jenica', '', 'f', 'test', NULL, '2009-08-02 17:12:00')